       IDENTIFICATION DIVISION.
       PROGRAM-ID. CATEGORIES-MNG.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION ALL INTRINSIC.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CATEGORIES ASSIGN TO "CATEGORIES"
           ORGANIZATION IS INDEXED
           RECORD KEY IS CATEGORY-ID
           ACCESS IS DYNAMIC

       DATA DIVISION.
       FILE SECTION.
       FD CATEGORY-ID.
           COPY CB-CATEGORIES.

       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM CATEGORY-ID-MNG.
