       01  CATEGORIES-DETAILS.
           88 EOFCATEGORIES                        VALUE HIGH-VALUES.
           05 CATEGORY-ID                          PIC 9(003).
           05 CATEGORY-DESCRIPTION.
               10 CATEGORY-DESCRIPTION-1           PIC X(050).
               10 CATEGORY-DESCRIPTION-2           PIC X(050).
               10 CATEGORY-DESCRIPTION-3           PIC X(050).
           05 CATEGORY-STATUS.
               10 CATEGORY-IS-ACTIVE               PIC 9.
