       01  SR-ING-REC.
           05  SR-SAND-ING-ID.
               10  SR-SANDWICH-ID          PIC 9(003).
               10  SR-INGREDIENT-ID        PIC 9(003).
