       01  SR-REC.
           05  SR-IID                  PIC 9(003).
           05  SR-EED                  PIC X(005).
           05  SR-S-DESCRIPTION        PIC X(030).
           05  SR-L-DESCRIPTION.
               10  SR-L-DESCRIPTION1   PIC X(050).
               10  SR-L-DESCRIPTION2   PIC X(050).
