       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOWERUPPER.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  LOWERCASE   PIC X(026) VALUE "abcdefghijklmnopqrstuvwxyz".
       01  UPPERCASE   PIC X(026) VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
       LINKAGE SECTION.
       01  LINK-TEXT        PIC X(150).

       PROCEDURE DIVISION USING LINK-TEXT.
       MAIN-PROCEDURE-START.

           INSPECT LINK-TEXT CONVERTING LOWERCASE TO UPPERCASE

           EXIT PROGRAM.
