       01  SAVE                                 PIC X(002).
           88 SAVE-YES                          VALUE "Y" "y".
           88 SAVE-NO                           VALUE "N" "n".
           88 SAVE-VALID                        VALUE "Y" "y" "N" "n".
       77  CALENDAR-TEST                        PIC 9(002).
       77  KEYS-TEST                            PIC 9(002).
       77  PRESS-KEY                            PIC X.
       01  F3EXIT                               PIC 9(004).
