      ******************************************************************
      *    LAB | THIRD PART | DELICIOUSSANDWICH
      ******************************************************************
      *    BREADWICH | REGISTRATION OF SANDWICH ORDERS
      ******************************************************************
      *    CREATE REPORT | V0.1 | IN UPDATE | 04.03.2021
      ******************************************************************

       IDENTIFICATION DIVISION.
       PROGRAM-ID. RSOREPORT.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FILEREPORT ASSIGN TO "RSOREPORT.RPT".

       DATA DIVISION.
       FILE SECTION.
       FD  FILEREPORT
           REPORT IS RSOREPORT.

       WORKING-STORAGE SECTION.
       COPY RSOCONTANTS.
       COPY RSOWSVAR.

       REPORT SECTION.
       RD  RSOREPORT

      *    PAGE LIMIT IS THE MAX NUMBER OF LINES PER PAGE.
           PAGE LIMIT IS 54
      *    FIRST DETAIL IS THE FIRST LINE WHERE THE TYPE IS DETAIL
      *    STARTS.
           FIRST DETAIL 5
      *    LAST DETAIL IS THE LAST LINE WHERE THE TYPE IS DETAIL ENDS.
           LAST DETAIL 46
      *    FOOTING IS THE LINE WHERE THE FOOTER STARTS.
           FOOTING 48.

      *    TYPE IS REPORT IS THE REPORTS NAME STRUCTURE.
      *    EACH WORD IS SEPARATED BY 3 SPACES AND EACH LETTER BY 1.
       01  TYPE IS REPORT HEADING.
           02 LINE 1.
           03 COLUMN 02 VALUE REPORTTITLECONST1.
           02 LINE PLUS 1.
           03 COLUMN 02 VALUE REPORTTITLECONST2.

      *    TYPE IS PAGE DEFINES THE HEADER STRUCTURE OF EVERY PAGE.
       01  TYPE IS PAGE HEADING.
           02 LINE IS PLUS 2.
           03 COLUMN 02 VALUE REPORTNUMBERCONST.
           03 COLUMN 17 VALUE REPORTNAMECONST.
           03 COLUMN 32 VALUE REPORTCODECONST.

      *    TYPE IS DETAIL IS THE REPORTS STRUCTURE, THE DATA WE READ
      *    FROM THE DATABASE WETHER IS A FILE OR AN ARRAY.
       01  DETAILSLINE TYPE IS DETAIL.
           02 LINE IS PLUS 1.
           03 COLUMN 02 PIC Z(5)
              SOURCE TBSUPPLIER-NUMBER (IND).
           03 COLUMN 17 PIC X(30)
              SOURCE TBSUPPLIER-NAME (IND).
           03 COLUMN 32 PIC X(2) SOURCE TBSUPPLIER-COUNTRY (IND).

      *    TYPE IS FOOTING IS THE FOOTER STRUCTURE OF EACH PAGE.
       01  TYPE IS PAGE FOOTING.
           02 LINE IS 49.
             03 COLUMN 60 PIC X(6) VALUE REPORTPAGECONST.
             03 COLUMN PLUS 1 PIC Z9 SOURCE PAGE-COUNTER.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           STOP RUN.
       END PROGRAM RSOREPORT.
