       IDENTIFICATION DIVISION.
       PROGRAM-ID. REMOVE-SPACES.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 SIGLASTRING                  PIC X(004).
       77 UNSTR                        PIC X(100).
       77 UNSTR1                       PIC X(015).
       77 UNSTR2                       PIC X(015).
       77 UNSTR3                       PIC X(015).
       77 UNSTR4                       PIC X(015).
       77 UNSTR5                       PIC X(015).
       77 UNSTR6                       PIC X(015).
       77 UNSTR7                       PIC X(015).
       77 UNSTR8                       PIC X(015).
       77 UNSTR9                       PIC X(015).
       77 UNSTR10                      PIC X(015).
       LINKAGE SECTION.
       01 TEXTO                        PIC X(100).

       PROCEDURE DIVISION USING TEXTO.
       MAIN-PROCEDURE-START.

           MOVE SPACE TO UNSTR UNSTR1 UNSTR2 UNSTR3 UNSTR4 UNSTR5
                               UNSTR6 UNSTR7 UNSTR8 UNSTR9 UNSTR10
           MOVE FUNCTION TRIM(TEXTO) TO UNSTR
           UNSTRING UNSTR DELIMITED BY ALL SPACES INTO UNSTR1
               UNSTR2 UNSTR3 UNSTR4 UNSTR5 UNSTR6 UNSTR7 UNSTR8 UNSTR9
               UNSTR10
           MOVE SPACE TO TEXTO
           STRING UNSTR1 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
                   UNSTR2 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
                   UNSTR3 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
                   UNSTR4 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
                   UNSTR5 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
                   UNSTR6 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
                   UNSTR7 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
                   UNSTR8 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
                   UNSTR9 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
                   UNSTR10 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
                   INTO TEXTO

           EXIT PROGRAM.
