
       IDENTIFICATION DIVISION.
       PROGRAM-ID. IMREPORT.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INVENTORY ASSIGN TO "INVENTORYFILE"
              ORGANIZATION IS INDEXED
              ACCESS MODE IS DYNAMIC
              RECORD KEY IS IM-ID.

           SELECT FILEREPORT ASSIGN TO "IMREPORT.RPT".

       DATA DIVISION.
       FILE SECTION.
       FD  INVENTORY.
       COPY FD-IM.

       FD  FILEREPORT
           REPORT IS IMREPORT.

       WORKING-STORAGE SECTION.
       COPY WS-IM.
       COPY IMTABLES.
       COPY IMCONSTANTS.

      ******************************************************************

       REPORT SECTION.
       RD  IMREPORT

      *    PAGE LIMIT IS THE MAX NUMBER OF LINES PER PAGE.
           PAGE LIMIT IS 54
      *    FIRST DETAIL IS THE FIRST LINE WHERE THE TYPE IS DETAIL
      *    STARTS.
           FIRST DETAIL 5
      *    LAST DETAIL IS THE LAST LINE WHERE THE TYPE IS DETAIL ENDS.
           LAST DETAIL 46
      *    FOOTING IS THE LINE WHERE THE FOOTER STARTS.
           FOOTING 48.

      *    TYPE IS REPORT IS THE REPORTS NAME STRUCTURE.
      *    EACH WORD IS SEPARATED BY 3 SPACES AND EACH LETTER BY 1.
       01  TYPE IS REPORT HEADING.
           02 LINE 1.
              03 COLUMN 02 VALUE REPORTTITLECONST1.
           02 LINE PLUS 1.
              03 COLUMN 02 VALUE REPORTTITLECONST2.
